usr/share/doc/escenic/system-info-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Welcome to the /usr/bin/system-info Guide</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-10-26 13:18:12 CST"/>
<meta name="author" content="Torstein Krause Johansen"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>

<div id="preamble">
<svg
        id="vizrt-logo"
        version="1.1"
        width="138"
        height="84"
        > 
  <g
          id="g12"
          transform="matrix(1.25,0,0,-1.25,-451.34003,425.24315)"> 
    <g
            id="g14"
            transform="matrix(0.0246257,0,0,0.02458666,313.76213,231.21317)"> 
      <path
              d="m 3060.56,3437.2 -209.9,-593.4 -207.05,593.4 -215.82,0 326.08,-866.38 184.92,0 332.24,866.38 -210.47,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path16"/> 
      <path
              d="m 3473.3,2569.82 193.547,0 0,866.531 -193.547,0 0,-866.531 z"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path18"/> 
      <path
              d="m 3916.16,3436.36 -0.14,-177.24 364.23,0 -372.91,-554.74 0,-133.56 616.08,0 0,175.25 -374.66,0 366.68,550.78 0,139.51 -599.28,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path20"/> 
      <path
              d="m 4961.8,3436.66 c -56.15,0 -99.9,-9.02 -144.01,-53.04 -42.13,-42.13 -63.55,-93.63 -63.55,-153.7 l 0,-658.85 193.26,0 0,629.18 c 0,16.39 5.76,30.04 17.53,41.82 9.79,9.87 32.16,17.44 52.18,17.44 l 161.49,0 0,177.15 -216.9,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path22"/> 
      <path
              d="m 5367.91,3699.54 0,-915.91 c 0,-58.68 20.75,-109.43 62.13,-150.8 43.31,-43.47 85.57,-62.01 141.03,-62.01 l 212.69,0 0,174.7 -158.78,0 c -15.96,0 -28.96,5.5 -40.72,16.87 -11.19,11.53 -16.76,24.5 -16.76,40.65 l 0,456.42 216.26,0 0,176.39 -216.26,0 0,263.69 -199.59,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path24"/> 
      <path
              d="m 1921.16,3066.86 c -0.39,-514.15 173.24,-988.49 465.56,-1367.51 l 69.26,204.63 c -205.49,300.61 -333.44,658.06 -355.3,1043.68 l -179.52,119.2"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path26"/> 
      <path
              d="m 6404.28,3065.28 c 0.49,513.97 -173.17,988.55 -465.37,1367.26 l -69.46,-204.34 c 205.52,-300.7 333.61,-658.34 355.24,-1043.68 l 179.59,-119.24"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path28"/> 
 
    </g> 
  </g> 
</svg>

</div>

<div id="content">
<h1 class="title">Welcome to the /usr/bin/system-info Guide</h1>

<p>This wee script gives a overview of your system, especially useful
when contacting Vizrt Online/Escenic Support.
</p>
<p>
The script will default wise produce a plain text report, but if you
pass -c or &ndash;confluence to it, it will generate Confluence Wiki markup
instead.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Example </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Example </h2>
<div class="outline-text-2" id="text-1">

<p>Here you can see an example of the output generated from system-info:
</p>



<pre class="src src-text">#########################################################################
System details for quanah
#########################################################################

#########################################################################
Kernel version
#########################################################################
Linux quanah 3.0.0-1-amd64 #1 SMP Sat Aug 27 16:21:11 UTC 2011 x86_64 GNU/Linux

#########################################################################
Distribution information
#########################################################################
Debian or derivate, version wheezy/sid

#########################################################################
Database details
#########################################################################
/usr/sbin/mysqld  Ver 5.1.58-1 for debian-linux-gnu on x86_64 ((Debian))

#########################################################################
Java version
#########################################################################
java version "1.6.0_26"
Java(TM) SE Runtime Environment (build 1.6.0_26-b03)
Java HotSpot(TM) 64-Bit Server VM (build 20.1-b02, mixed mode)

#########################################################################
Important packages
#########################################################################
ant                                      1.8.2-4                              Java based build tool like make
libapr1                                  1.4.5-1                              Apache Portable Runtime Library
libmysql-java                            5.1.16-2                             Java database (JDBC) driver for MySQL
libtcnative-1                            1.1.22-1                             Tomcat native library using the apache portable runtime
maven2                                   2.2.1-10                             Java software project management and comprehension tool
mysql-server                             5.1.58-1                             MySQL database server (metapackage depending on the latest version)
nginx                                    1.1.4-2                              small, but very powerful and efficient web server and mail proxy
sun-java6-jdk                            6.26-3                               Sun Java(TM) Development Kit (JDK) 6
sun-java6-jre                            6.26-3                               Sun Java(TM) Runtime Environment (JRE) 6 (architecture independent files)
tomcat6-user                             6.0.32-6                             Servlet and JSP engine -- tools to create user instances
varnish                                  3.0.1-1~squeeze1                     state of the art, high-performance web accelerator

#########################################################################
Processors
#########################################################################
Processor type:  Intel(R) Core(TM)2 Duo CPU P8600 @ 2.40GHz
Number of processors/cores: 1

#########################################################################
Memory
#########################################################################
Total memory:  3792504 kB
Free memory:  339096 kB

#########################################################################
Disk Storage
#########################################################################
Filesystem     Type     Size  Used Avail Use% Mounted on
/dev/sda3      ext3     141G  127G  7.2G  95% /
tmpfs          tmpfs    5.0M  8.0K  5.0M   1% /lib/init/rw
tmpfs          tmpfs    371M  812K  370M   1% /run
udev           tmpfs    1.9G     0  1.9G   0% /dev
tmpfs          tmpfs    741M  420K  741M   1% /run/shm
shmfs          tmpfs    1.9G   12K  1.9G   1% /lib/init/rw/splashy
/dev/sda2      hfsplus   96G   89G  6.3G  94% /mnt/mac
</pre>

</div>
</div>
</div>

<div id="postamble">
<hr/>
<p class="author">
  Author: Torstein Krause Johansen (<a href="mailto:tkj@vizrt.com">tkj@vizrt.com</a>)
  Date: 2011-10-26 13:18:12 CST
</p>
</div>
</body>
</html>
